Revit 2026 API

# TopographySurfaceMovePoints Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
public void MovePoints(
	IList<XYZ> movedPoints,
	XYZ moveVector
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")>
Public Sub MovePoints (
	movedPoints As IList(Of XYZ),
	moveVector As XYZ
)
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
void MovePoints(
	IList<XYZ^>^ movedPoints,
	XYZ^ moveVector
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")>]
member MovePoints :
        movedPoints : IList<XYZ> *
        moveVector : XYZ -> unit
```

#### Parameters

movedPoints IListXYZ

moveVector XYZ

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace